davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
    /* Infinite loop */
    for(;;)
    {

     current_minute = iqs263_get_min_if_pressed(); //returns -1 if no press
     if (current_minute != -1) { //touch!

  	   touch_end_count = 1;  //flag to check when done with touch event

  	   if (last_minute != current_minute) {
  		   //update touch stuff!
  		   last_minute = current_minute;
  	   	   er_oled_print_2digit(current_minute);

  	   	   uint16_t touchval = 0x4000 | current_minute;
  	   	   osMessageQueuePut(bleTXqueueHandle, &touchval, 0, 0);
  	   }

  	   //optional
  	   osDelay(25);


  	   //char str[3];
  	   //sprintf(str, "%d", current_minute);


     } else if (touch_end_count > 0){

  	   touch_end_count += 1;//increment touching_end_count

  	   if (touch_end_count >= TOUCH_END_TIMEOUT){  //if it hits this value, we're done

  		   touch_end_count = 0;

  		   //DO THINGS WITH CONFIRMED TOUCH == LAST_MINUTE
  		   char out_text[10];
  		   sprintf(out_text, "FINAL: %d", last_minute);

  		   uint16_t touchval = 0x5000 | last_minute;
  		   osMessageQueuePut(bleTXqueueHandle, &touchval, 0, 0);

  		   last_minute = -1;

  	   }

  	   osDelay(25);


     }else { //no touch, wait for a touch

       if (GlobalState.programMode == MODE_CANCEL){
    	   //had a 'cancel' button event

    	   er_oled_clear(oled_buf);
   	   	   er_oled_string(0, 0, "  dismiss!", 12, 1, oled_buf);
   	   	   er_oled_string(0, 28, "TIME NOW IS:", 12, 1, oled_buf);
   	   	   er_oled_display(oled_buf);

   	   	   osDelay(1000);

   	   	   osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
   	   	   HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
   	   	   HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
   	   	   osMutexRelease(rtcMutexHandle);

   	   	   uint8_t  hrs = RTC_Bcd2ToByte(cTime.Hours);
   	   	   uint8_t mins = RTC_Bcd2ToByte(cTime.Minutes);
   	   	   char time[5];
   	   	   sprintf (time, "%02d%02d", hrs, mins);
   	   	   er_oled_time(time);

	       osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
	       GlobalState.lastSeenTime.time = cTime;
	       GlobalState.lastSeenTime.date = cDate;
	       osMutexRelease(lastSeenMutexHandle);

	       bleSendData.sendType = TX_TIME_SEEN;
	       bleSendData.data = 0x0000;
	       osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

	       osMutexAcquire(modeMutexHandle, portMAX_DELAY);
	       GlobalState.programMode = MODE_RESTING;
	       osMutexRelease(modeMutexHandle);

	       osDelay(3000);
	       er_oled_clear(oled_buf);
	       er_oled_display(oled_buf);

       } else if (GlobalState.programMode == MODE_ERROR) {
    	   //ERROR condition: print condition and loop forever

    	   er_oled_clear(oled_buf);
    	   er_oled_string(0, 12, errorCondition, 12, 1, oled_buf);
    	   er_oled_display(oled_buf);
    	   for (;;){}
       }

       osDelay(250);

     }
    }



  /* USER CODE END startUIControl */
}

/* USER CODE BEGIN Header_startESMMain */
/**
* @brief Function implementing the esmMain thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startESMMain */
void startESMMain(void *argument)
{
  /* USER CODE BEGIN startESMMain */


  const BLETX_Queue_t bleSendData = {TX_SURVEY_INITIALIZED, 0x0000};
  #define INTERACTION_TIMEOUT 20000
  uint32_t notTimeout;

  /* Infinite loop */
  for(;;)
  {
    //check state, get mode, call timer if necessary

    //xTaskNotifyGive(startAlertHandle); to alert user with flash and vibration
    osDelay(5000);

    //at random interval, bounded by timebounds ONLY WHEN IN MODE_RESTING
    //(MODE_CANCEL/MODE_TIME_ESTIMATE can happen when user is looking at time;
    //we want to wait for these to complete and use the updated time for estimating
    //intervals

    //if >timebound interval selection + lasttimeseen
	//if between hours of timebound
    //if mode is mode_resting
    //
    if (GlobalState.programMode == MODE_RESTING){

    	//1. set program mode to MODE_ESM_TIME_ESTIMATE
    	osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    	GlobalState.programMode = MODE_ESM_TIME_ESTIMATE;
    	osMutexRelease(modeMutexHandle);

    	//2. send TX_SURVEY_INITIALIZED
    	osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

    	uint8_t no_interaction = 1;
    	while(no_interaction){

    		//3. alert:
    		xTaskNotifyGive(alertHandle);

    		//4. wait for notification from UI thread with timeout that indicates
    		//start of user interaction
    		notTimeout = ulTaskNotifyTake( pdTRUE, INTERACTION_TIMEOUT);

    		if (notTimeout){ //not a timeout, interaction started
    			no_interaction = 0;

    			if (GlobalState.programMode == MODE_ESM_TIME_ESTIMATE){
    			//if this is NOT true, we had a cancel event or snooze
    			//and should just leave.  otherwise we'll continue with our
    			//survey experience within this statement:

    			//wait for notification from UI thread that indicates end of user interaction
    			notTimeout = ulTaskNotifyTake( pdTRUE, INTERACTION_TIMEOUT);


    			}
    		}
    	}
    	//if timeout, check program_mode.  If program_mode was
    	//set to mode other than MODE_ESM_TIME_ESTIMATE, exit.
    	//else rebuzz.  otherwise, if valid entry, continue onward.
    }

    //osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
	//osMutexRelease(ledStateMutexHandle);

    //floats are 32-bits, so 4 bytes. 16 bytes for total
   	//osMessageQueuePut(bleRXqueueHandle, &(pNotification->DataTransfered), 0, 0);
    //const BLETX_Queue_t bleSendData = {TX_TEMP_HUMD, 0x0000};
    //osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

  }
  /* USER CODE END startESMMain */
}

/* USER CODE BEGIN Header_startButtonPress */
/**
* @brief Function implementing the buttonPress thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startButtonPress */
void startButtonPress(void *argument)
{
  /* USER CODE BEGIN startButtonPress */
  /* Infinite loop */

  //Buttons are PULLED UP and drop to 0 when pressed
  uint8_t buttonState[] = {1, 1, 1};
  uint32_t callingPin = 0x00;

  const BLETX_Queue_t bleSendData = {TX_LAST_SURVEY_INVALID, 0x0000};

  for(;;)
  {
	//wait for rising or falling edge trigger, put calling pin in callingPin
	xTaskNotifyWait(0x00, 0x00, &callingPin, portMAX_DELAY);

	//check state of pin
	GPIO_PinState first_read = HAL_GPIO_ReadPin(GPIOB, callingPin);

	//wait 50ms
    osDelay(50);

