davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
    //check again (debounce) to get a good reading
	if (first_read == HAL_GPIO_ReadPin(GPIOB, callingPin)){

		//check that we are actually changing state; the edge trigger should only call
		//when this happens (except during debouncing) so we expect this to be true
		//almost always

		//callingPin can be used as bitmask Pin 5/4/3 give 1000000/10000/1000

		if (callingPin == 0b1000 && first_read != buttonState[0]) { //button 1 trigger
		  //set buttonState
		  buttonState[0] = first_read;

		  //do stuff if button pressed
		  if (!first_read){
			  osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

			  osMutexAcquire(modeMutexHandle, portMAX_DELAY);
			  GlobalState.programMode = MODE_CANCEL;
			  osMutexRelease(modeMutexHandle);
		  }

		}
		if (callingPin == 0b10000 && first_read != buttonState[1]) { //button 2 trigger
		    //set buttonState
		    buttonState[1] = first_read;

		    //do stuff if button pressed
		    if (!first_read){
		    	osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

		    	osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		    	GlobalState.programMode = MODE_CANCEL;
		    	osMutexRelease(modeMutexHandle);
		    }
		}
		if (callingPin == 0b100000 && first_read != buttonState[2]) { //button 3 trigger
		    //set buttonState
		    buttonState[2] = first_read;

		    //do stuff if button pressed
		    if (!first_read){
		    	osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

		    	osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		    	GlobalState.programMode = MODE_CANCEL;
		        osMutexRelease(modeMutexHandle);
		    }
		}

	}

  }
  /* USER CODE END startButtonPress */
}

/* USER CODE BEGIN Header_startAlert */
/**
* @brief Function implementing the alert thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startAlert */
void startAlert(void *argument)
{
  /* USER CODE BEGIN startAlert */

  //xTaskNotifyGive(alertHandle); to alert user with flash and vibration

  //HAL_GPIO_WritePin(VIBRATION_GPIO_Port, VIBRATION_Pin, GPIO_PIN_RESET);

  //Init Vibration Motor PWM Parameters
  int duty_cycle = 79; //0 is off, up to ~80
  htim1.Instance->CCR2 = duty_cycle;

  //Dotstar Init
  DotStar_InitHandle dotstar;
  dotstar.spiHandle = &hspi1;
  dotstar.numLEDs = NUM_PIXELS;
  dotstar.colorOrder = DOTSTAR_BGR;
  Dotstar_Init(&dotstar);

  ds_clear();  //turn off
  ds_show();

  const uint8_t MAX_BRIGHTNESS = 0x33; //max brightness, 0x01-0xFF

  ds_setBrightness(0);
  osDelay(1000);

  uint16_t counter;
  uint8_t LEDDirection, LEDBrightness;

  /* Infinite loop */
  for(;;)
  {

	counter = 0;
	LEDDirection = 0;
	LEDBrightness = 0;

	ulTaskNotifyTake( pdTRUE, portMAX_DELAY);

	//start vibration
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);

	//flash loop
	ds_fill(0xFFFFFF, 0, 12);

	while (counter++ < MAX_BRIGHTNESS*2) {

		ds_setBrightness(LEDBrightness);
		ds_show();

		//increment color intensity
		if (LEDDirection) {LEDBrightness--;}
		else {LEDBrightness++;}

		//if we hit a limit switch color scaling up or down
		if (LEDBrightness == MAX_BRIGHTNESS) {LEDDirection = 1;}
		if (LEDBrightness == 0x00) {LEDDirection = 0;}

		osDelay(pdMS_TO_TICKS(2)); //2ms delay
	}

	//turn off LEDs
	ds_setBrightness(0);
	ds_fill(0x000000, 0, 12);
	ds_show();

	osDelay(pdMS_TO_TICKS(100)); //100ms delay

    //stop vibration
    HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);


  }
  /* USER CODE END startAlert */
}

/* USER CODE BEGIN Header_startConditionsPoll */
/**
* @brief Function implementing the conditionsPoll thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startConditionsPoll */
void startConditionsPoll(void *argument)
{
	osDelay(500); //let screen start first

	//poll ambient temp, humidity, visible light, white light
	//every 5sec
  	if (veml_Setup(hi2c1, VEML_5S_POLLING) == HAL_ERROR){
  		//error condition
  		strncpy(errorCondition, "ERR:VEML7700", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	osDelay(10);

  	if (si7021_set_config(&hi2c1, SI7021_HEATER_OFF, SI7021_RESOLUTION_RH12_TEMP14) == HAL_ERROR) {
  		//error condition
  		strncpy(errorCondition, "ERR:SI7021CF", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	osDelay(10);

  	if (si7021_set_heater_power(&hi2c1, SI7021_HEATER_POWER_3MA) == HAL_ERROR) {
  		//error condition
  		strncpy(errorCondition, "ERR:SI7021HT", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	float lux;
  	float whiteLux;
  	float humidity;
    float temperature;

    const BLETX_Queue_t bleSendData = {TX_TEMP_HUMD, 0x0000};

  	for (;;){

  		lux = veml_Get_Lux();
    	whiteLux = veml_Get_White_Lux();
    	temperature = si7021_measure_temperature(&hi2c1);
    	humidity = si7021_measure_humidity(&hi2c1);

    	osMutexAcquire(conditionMutexHandle, portMAX_DELAY);
    	GlobalState.lastConditions.lux = lux;
    	GlobalState.lastConditions.whiteLux = whiteLux;
    	GlobalState.lastConditions.temp = temperature;
    	GlobalState.lastConditions.humd = humidity;
    	osMutexRelease(conditionMutexHandle);

		osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

    	osDelay(9900);
  	}

/* USER CODE END startConditionsPoll */
}


/* USER CODE BEGIN Header_startBLETX */
/**
* @brief Function implementing the bleTX thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startBLETX */
void startBLETX(void *argument)
{
  /* USER CODE BEGIN startBLETX */
  BLETX_Queue_t sendData;

  /* Infinite loop */
  for(;;)
  {
    if (osMessageQueueGet(bleTXqueueHandle, &sendData, NULL, osWaitForever) == osOK){

    	//TX_TIME_SEEN - data in GlobalState.lastSeenTime

    	//TX_TIME_EST - data in GlobalState.timeEstimateSample

    	//TX_TEMP_HUMD - construct both TX_TEMP_HUMD/TX_LUX_WHITELUX
    	//               with data in GlobalState.lastConditions

    	//TX_LAST_SURVEY_INVALID -- just send that timestamped

    	//TX_SURVEY_INITIALIZED -- just send that timestamped

    	//TX_TIMESTAMP_UPDATE -- use data in sendData for error, to send
    	//TX_SURVEY_RESULT -- use data in sendData, first byte is survey/second is answer

