davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
    	P2PS_Send_Data(sendData.data);
    }
  }
  /* USER CODE END startBLETX */
}

/* USER CODE BEGIN Header_startBLERX */
/**
* @brief Function implementing the bleRX thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startBLERX */
void startBLERX(void *argument)
{
  /* USER CODE BEGIN startBLERX */
  /* Infinite loop */

  P2PS_STM_Data_t rxData;

  for(;;)
  {

	if (osMessageQueueGet(bleRXqueueHandle, &rxData, NULL, osWaitForever) == osOK){

		if (rxData.pPayload[0] == 0x00) { // timestamp update starts with 0x00
			memcpy(&P2P_Server_App_Context.OTATimestamp, &(rxData.pPayload[1]), 8);
    	    P2P_Server_App_Context.OTA12HrFormat = rxData.pPayload[9];
    		P2P_Server_App_Context.OTADaylightSavings = rxData.pPayload[10];

    	    RTC_TimeTypeDef sTime = {0};
    		RTC_DateTypeDef sDate = {0};

    		uint8_t timestampvals[8];
    		memcpy(timestampvals, &(P2P_Server_App_Context.OTATimestamp), 8);

    		uint8_t AMPM = timestampvals[0];

    		sTime.Hours      = timestampvals[4];
    		sTime.Minutes    = timestampvals[5];
    		sTime.Seconds    = timestampvals[6];
    		sTime.SubSeconds = 0x0;
    		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;

    		if (P2P_Server_App_Context.OTADaylightSavings){ sTime.DayLightSaving = RTC_DAYLIGHTSAVING_ADD1H; }

    		sTime.StoreOperation = RTC_STOREOPERATION_RESET;

    		sDate.WeekDay = timestampvals[0];
    		sDate.Month   = timestampvals[1];
    		sDate.Date    = timestampvals[2];
    		sDate.Year    = timestampvals[3];

    		osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
    		if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK) {Error_Handler();}
    		if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK) {Error_Handler();}
    	    osMutexRelease(rtcMutexHandle);

		}


/*		else if (rxData.pPayload[0] == 0x06) {//screen text update starts with 0x06

			//works great if string sent is <=18 and has a '00' byte (19 + update byte, 20 byte MTU)
			//'00' obviously connotes the end of the string.
			//should edit this to have a char buffer in place (128 byte) that copies over
			// rxData.pPayload[1] for rxData.Length - 1, check last byte.  if 00 stop,
			//otherwise wait and keep filling buffer with next packet.
			//write a complementary send function that adds a hex '00' and chops the full string
			//into 19 byte chunks when sending with 0x01 header from phone.
			strncpy(&(textbuffer[continuing*19]), &(rxData.pPayload[1]), rxData.Length - 1);
			continuing += 1;

			if (rxData.pPayload[rxData.Length-1] == 0x00) { //completed string

				osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
				strncpy(ScreenState.screenText, textbuffer, 128);
				osMutexRelease(screenTextMutexHandle);
				xTaskNotify(screenUpdateHandle, (uint32_t)SCREEN_TEXT, eSetValueWithOverwrite);

				continuing = 0;

			}

			//osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
			//strncpy(ScreenState.screenText, &(rxData.pPayload[1]), rxData.Length - 1);
			//osMutexRelease(screenTextMutexHandle);
			//xTaskNotify(screenUpdateHandle, (uint32_t)SCREEN_TEXT, eSetValueWithOverwrite);

		} else if (rxData.pPayload[0] == 0x03) { //vibrate payload with duration to vibrate starts with 0x03

			//uint8_t duration[4] = {0};
	    	//memcpy(&(duration[4-(rxData.Length-1)]), &(rxData.pPayload[1]), rxData.Length-1);
	    	//uint32_t send_duration = duration[0] << 24 | duration[1] << 16 | duration[2] << 8 | duration[3];

	    	uint32_t send_duration = 0;
	    	for (uint8_t i=0; i<rxData.Length-1; i++){
	    		send_duration |= rxData.pPayload[1+i] << ((rxData.Length-2-i)*8);
	    	}

	    	xTaskNotify(vibrateControlHandle, send_duration, eSetValueWithOverwrite);
	    } else if (rxData.pPayload[0] == 0x07) { //led state update
	    	osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
	    	LedState.currentMode = rxData.pPayload[1];
	    	osMutexRelease(ledStateMutexHandle);
	    }*/
	}
  }
  /* USER CODE END startBLERX */
}


void PeriphClock_Config(void)
{
  #if (CFG_USB_INTERFACE_ENABLE != 0)
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };
	RCC_CRSInitTypeDef RCC_CRSInitStruct = { 0 };

	/**
   * This prevents the CPU2 to disable the HSI48 oscillator when
   * it does not use anymore the RNG IP
   */
  LL_HSEM_1StepLock( HSEM, 5 );

  LL_RCC_HSI48_Enable();

	while(!LL_RCC_HSI48_IsReady());

	/* Select HSI48 as USB clock source */
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USB;
	PeriphClkInitStruct.UsbClockSelection = RCC_USBCLKSOURCE_HSI48;
	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);

	/*Configure the clock recovery system (CRS)**********************************/

	/* Enable CRS Clock */
	__HAL_RCC_CRS_CLK_ENABLE();

	/* Default Synchro Signal division factor (not divided) */
	RCC_CRSInitStruct.Prescaler = RCC_CRS_SYNC_DIV1;

	/* Set the SYNCSRC[1:0] bits according to CRS_Source value */
	RCC_CRSInitStruct.Source = RCC_CRS_SYNC_SOURCE_USB;

	/* HSI48 is synchronized with USB SOF at 1KHz rate */
	RCC_CRSInitStruct.ReloadValue = RCC_CRS_RELOADVALUE_DEFAULT;
	RCC_CRSInitStruct.ErrorLimitValue = RCC_CRS_ERRORLIMIT_DEFAULT;

	RCC_CRSInitStruct.Polarity = RCC_CRS_SYNC_POLARITY_RISING;

	/* Set the TRIM[5:0] to the default value*/
	RCC_CRSInitStruct.HSI48CalibrationValue = RCC_CRS_HSI48CALIBRATION_DEFAULT;

	/* Start automatic synchronization */
	HAL_RCCEx_CRSConfig(&RCC_CRSInitStruct);
#endif

	return;
}
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

static void Config_HSE(void)
{
    OTP_ID0_t * p_otp;

  /**
   * Read HSE_Tuning from OTP
   */
  p_otp = (OTP_ID0_t *) OTP_Read(0);
  if (p_otp)
  {
    LL_RCC_HSE_SetCapacitorTuning(p_otp->hse_tuning);
  }

  return;
}  

static void Reset_Device( void )
{
#if ( CFG_HW_RESET_BY_FW == 1 )
	Reset_BackupDomain();

	Reset_IPCC();
#endif

	return;
}

static void Reset_IPCC( void )
{
	LL_AHB3_GRP1_EnableClock(LL_AHB3_GRP1_PERIPH_IPCC);

	LL_C1_IPCC_ClearFlag_CHx(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_ClearFlag_CHx(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C1_IPCC_DisableTransmitChannel(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_DisableTransmitChannel(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C1_IPCC_DisableReceiveChannel(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_DisableReceiveChannel(
			IPCC,
			LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4
			| LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	return;
}

static void Reset_BackupDomain( void )
{
	if ((LL_RCC_IsActiveFlag_PINRST() != FALSE) && (LL_RCC_IsActiveFlag_SFTRST() == FALSE))
	{
		HAL_PWR_EnableBkUpAccess(); /**< Enable access to the RTC registers */

		/**
		 *  Write twice the value to flush the APB-AHB bridge
		 *  This bit shall be written in the register before writing the next one
		 */
		HAL_PWR_EnableBkUpAccess();

